; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v4 - type_1)
 	      (pred_3 ?v7 - object ?v4 - type_1)
	      (pred_1 ?v6 - type_2 ?v3 - type_3)
	      (pred_2 ?v6 - type_2 ?v7 - object ?v3 - type_3))

   (:action op_2
       :parameters  (?v6 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_4 ?v6 ?v1))
       :effect (and  (pred_4 ?v6 ?v8)
		     (not (pred_4 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_2 ?v5 - object ?v2 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v2) (pred_4 ?v6 ?v2) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v2)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_2 ?v5 - object ?v2 - type_1 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v5 ?v3) (pred_4 ?v6 ?v2))
       :effect (and (pred_3 ?v5 ?v2)
		    (pred_1 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_02 - type_2
obj_01 obj_10 obj_09 obj_12 - type_3
obj_06 obj_13 obj_05 obj_07 - type_1
obj_11 obj_14 obj_04 obj_08 - object)
(:init
(pred_4 obj_03 obj_06)
(pred_1 obj_03 obj_01)
(pred_1 obj_03 obj_10)
(pred_4 obj_02 obj_06)
(pred_1 obj_02 obj_09)
(pred_1 obj_02 obj_12)
(pred_3 obj_11 obj_06)
(pred_3 obj_14 obj_06)
(pred_3 obj_04 obj_05)
(pred_3 obj_08 obj_05)
)
(:goal
(and
(pred_3 obj_11 obj_13)
(pred_3 obj_14 obj_07)
(pred_3 obj_04 obj_06)
(pred_3 obj_08 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_03 obj_05)))
)
)

; plan
1. (op_3 obj_03 obj_11 obj_06 obj_10)
   deleted: (pred_3 obj_11 obj_06) (pred_1 obj_03 obj_10)
   added: (pred_2 obj_03 obj_11 obj_10)
   goals met: 0 of 4
2. (op_3 obj_02 obj_14 obj_06 obj_12)
   deleted: (pred_3 obj_14 obj_06) (pred_1 obj_02 obj_12)
   added: (pred_2 obj_02 obj_14 obj_12)
   goals met: 0 of 4
3. (op_2 obj_02 obj_06 obj_07)
   deleted: (pred_4 obj_02 obj_06)
   added: (pred_4 obj_02 obj_07)
   goals met: 0 of 4
4. (op_2 obj_03 obj_06 obj_13)
   deleted: (pred_4 obj_03 obj_06)
   added: (pred_4 obj_03 obj_13)
   goals met: 0 of 4
5. (op_1 obj_02 obj_14 obj_07 obj_12)
   deleted: (pred_2 obj_02 obj_14 obj_12)
   added: (pred_3 obj_14 obj_07) (pred_1 obj_02 obj_12)
   goals met: 1 of 4
6. (op_1 obj_03 obj_11 obj_13 obj_10)
   deleted: (pred_2 obj_03 obj_11 obj_10)
   added: (pred_3 obj_11 obj_13) (pred_1 obj_03 obj_10)
   goals met: 2 of 4
7. (op_2 obj_03 obj_13 obj_06)
   deleted: (pred_4 obj_03 obj_13)
   added: (pred_4 obj_03 obj_06)
   goals met: 2 of 4
8. (op_2 obj_02 obj_07 obj_05)
   deleted: (pred_4 obj_02 obj_07)
   added: (pred_4 obj_02 obj_05)
   goals met: 2 of 4
9. (op_3 obj_02 obj_08 obj_05 obj_12)
   deleted: (pred_3 obj_08 obj_05) (pred_1 obj_02 obj_12)
   added: (pred_2 obj_02 obj_08 obj_12)
   goals met: 2 of 4
10. (op_3 obj_02 obj_04 obj_05 obj_09)
   deleted: (pred_3 obj_04 obj_05) (pred_1 obj_02 obj_09)
   added: (pred_2 obj_02 obj_04 obj_09)
   goals met: 2 of 4
11. (op_2 obj_02 obj_05 obj_13)
   deleted: (pred_4 obj_02 obj_05)
   added: (pred_4 obj_02 obj_13)
   goals met: 2 of 4
12. (op_1 obj_02 obj_08 obj_13 obj_12)
   deleted: (pred_2 obj_02 obj_08 obj_12)
   added: (pred_3 obj_08 obj_13) (pred_1 obj_02 obj_12)
   goals met: 3 of 4
13. (op_2 obj_02 obj_13 obj_06)
   deleted: (pred_4 obj_02 obj_13)
   added: (pred_4 obj_02 obj_06)
   goals met: 3 of 4
14. (op_1 obj_02 obj_04 obj_06 obj_09)
   deleted: (pred_2 obj_02 obj_04 obj_09)
   added: (pred_3 obj_04 obj_06) (pred_1 obj_02 obj_09)
   goals met: 4 of 4
